"Дано ціле число n (1 ≤ n ≤ 4), яке визначає пору року: весна, літо,осінь, зима. За вказаним значенням n необхідно надрукувати перелікмісяців, які відносяться до цієї пори року.Виконав Петюх Олександр"
# Введення значення n
n = int(input("Введіть число n (1 ≤ n ≤ 4): "))

# Алгоритмічна структура розгалуження
if n == 1:
    print("Місяці весни: березень, квітень, травень.")
elif n == 2:
    print("Місяці літа: червень, липень, серпень.")
elif n == 3:
    print("Місяці осені: вересень, жовтень, листопад.")
elif n == 4:
    print("Місяці зими: грудень, січень, лютий.")
else:
    print("Невірне значення n.")
