"Шаховий кінь ходить літерою «Г» - на дві клітини по вертикалі вбудь-якому напрямку і на одну клітинку по горизонталі, або навпаки.Дано дві різні клітинки шахової дошки, визначте, чи може кіньпотрапити з першої клітинки на другу за один хід. Програма отримуєна вхід чотири числа від 1 до 8 кожне, що задають номер стовпця іномер рядка спочатку для першої клітинки, потім для другої клітинки.Програма повинна вивести Yes, якщо з першої клітинки ходом коняможна потрапити в другу або No в іншому випадку.Виконав Петюх О.В"
# Введення координат клітинок
x1, y1 = map(int, input("Введіть координати першої клітинки (стовпець рядок): ").split())
x2, y2 = map(int, input("Введіть координати другої клітинки (стовпець рядок): ").split())

# Алгоритмічна структура розгалуження
dx = abs(x1 - x2)
dy = abs(y1 - y2)

if (dx == 1 and dy == 2) or (dx == 2 and dy == 1):
    print("Yes")
else:
    print("No")
